Examinator/src/DataProcessors/ПубликацияЭлектронныхРесурсовСУЗ/ПубликацияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПубликацияЭлектронныхРесурсовСУЗ</name>
  <attributes>
    <name>ТипПубликации</name>
    <type>
      <types>EnumRef.ТипыПубликацийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтарыеПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьАктивность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьБраузер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьФорматВидеоWEBM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляСохранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьИнтерфейсПреподавателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскиеСтили</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкИнтерфейса</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмещениеКнопкиВыхода</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияКнопкиВыходаСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ПубликацииЭлектронныхРесурсовСУЗ/ПубликацииЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПубликацииЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЭлектронногоРесурса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеКнопкиВыхода</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияКнопкиВыходаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещеныДанныеДляВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыПубликацийЭлектронныхРесурсовСУЗ/ТипыПубликацийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПубликацийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCORM_1_3</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыРазмещенияКнопкиВыходаСУЗ/ВариантыРазмещенияКнопкиВыходаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРазмещенияКнопкиВыходаСУЗ</name>
  <enumValues>
    <name>СправаИсчезающая</name>
  </enumValues>
  <enumValues>
    <name>СправаФиксированная</name>
  </enumValues>
  <enumValues>
    <name>СлеваИсчезающая</name>
  </enumValues>
  <enumValues>
    <name>СлеваФиксированная</name>
  </enumValues>
  <enumValues>
    <name>БезКнопки</name>
  </enumValues>
  <enumValues>
    <name>ВКоманднойПанели</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/ПубликацияЭлектронныхРесурсовСУЗ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Определяем тип публикации
	
	Если ТипЗнч(Параметры.ТипПубликации) = Тип("Строка") Тогда
		Параметры.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ[Параметры.ТипПубликации];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТипПубликации) Тогда
		
		Объект.ТипПубликации = Параметры.ТипПубликации;
		
		Если Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда
			
			ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
			
			Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог(),,,,Отказ);
				
				Возврат;
				
			КонецЕсли;				
			
		КонецЕсли;		
		
	Иначе
		
		Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML;
		
		ЭлектронныеРесурсыПереопределяемый.ПриОпределенииТипПубликацииПоУмолчанию(Объект.ТипПубликации);		
		
	КонецЕсли;	
	
	// Заполняем ТЧ ЭлектронныеРесурсы
	
	ТаблицаЗаполняемыхЭР = Новый ТаблицаЗначений;
	ТаблицаЗаполняемыхЭР.Колонки.Добавить("ЭлектронныйРесурс", Новый ОписаниеТипов("СправочникСсылка.СводыЗнанийСУЗ"));
	ТаблицаЗаполняемыхЭР.Колонки.Добавить("Тип", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЭлектронныхРесурсовСУЗ"));
	
	Если Параметры.ЭлектронныеРесурсы <> Неопределено
		И ТипЗнч(Параметры.ЭлектронныеРесурсы) = Тип("Массив") Тогда
		
		Для каждого Элемент Из Параметры.ЭлектронныеРесурсы Цикл
		
			СвойстваЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент, "ЭтоГруппа, ПометкаУдаления, Тип");
			
			Если СвойстваЭлемента.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			Если СвойстваЭлемента.ЭтоГруппа Тогда
		
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	СводыЗнанийСУЗ.Ссылка КАК ЭлектронныйРесурс,
					|	СводыЗнанийСУЗ.Тип
					|ИЗ
					|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
					|ГДЕ
					|	СводыЗнанийСУЗ.ЭтоГруппа = ЛОЖЬ
					|	И СводыЗнанийСУЗ.ПометкаУдаления = ЛОЖЬ
					|	И СводыЗнанийСУЗ.Ссылка В ИЕРАРХИИ(&Группа)";
				
				Запрос.УстановитьПараметр("Группа", Элемент);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НоваяСтрокаТЭР = ТаблицаЗаполняемыхЭР.Добавить();
					НоваяСтрокаТЭР.ЭлектронныйРесурс = ВыборкаДетальныеЗаписи.ЭлектронныйРесурс;
					НоваяСтрокаТЭР.Тип = ВыборкаДетальныеЗаписи.Тип;
				КонецЦикла;
	
			Иначе
				
				Если ТипЗнч(Элемент) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда					
					НоваяСтрокаТЭР = ТаблицаЗаполняемыхЭР.Добавить();
					НоваяСтрокаТЭР.ЭлектронныйРесурс = Элемент;
					НоваяСтрокаТЭР.Тип = СвойстваЭлемента.Тип;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СводыЗнанийСУЗ.Ссылка,
			|	СводыЗнанийСУЗ.Тип
			|ИЗ
			|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
			|ГДЕ
			|	СводыЗнанийСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И СводыЗнанийСУЗ.ПометкаУдаления = ЛОЖЬ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрокаТЭР = ТаблицаЗаполняемыхЭР.Добавить();
			НоваяСтрокаТЭР.ЭлектронныйРесурс = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяСтрокаТЭР.Тип = ВыборкаДетальныеЗаписи.Тип;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СодержаниеСУЗ.Ссылка) КАК КоличествоЭлементов,
		|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец В(&МассивЭлектронныхРесурсов)
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержаниеСУЗ.Владелец";
	
	Запрос.УстановитьПараметр("МассивЭлектронныхРесурсов", ТаблицаЗаполняемыхЭР.ВыгрузитьКолонку("ЭлектронныйРесурс"));
	
	ТаблицаЭлементовСодержания = Запрос.Выполнить().Выгрузить();
	
	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаЗаполняемыхЭР);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЭР.ЭлектронныйРесурс,
		|	ТаблицаЭР.Тип
		|ПОМЕСТИТЬ ТаблицаЭР
		|ИЗ
		|	&ВнешнийИсточник КАК ТаблицаЭР
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТаблицаЭР.ЭлектронныйРесурс";
	
	Запрос.Выполнить();
	
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЭР.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ТаблицаЭР.Тип КАК Тип,
		|	Публикации.РазмещениеКнопкиВыхода КАК РазмещениеКнопкиВыхода,
		|	Публикации.Период КАК ДатаПубликации
		|ИЗ
		|	ТаблицаЭР КАК ТаблицаЭР
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубликацииЭлектронныхРесурсовСУЗ.СрезПоследних КАК Публикации
		|		ПО (Публикации.ЭлектронныйРесурс = ТаблицаЭР.ЭлектронныйРесурс)";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.ЭлектронныеРесурсы.Добавить();
		НоваяСтрока.ЭлектронныйРесурс = ВыборкаДетальныеЗаписи.ЭлектронныйРесурс;
		НоваяСтрока.ЭтоТест = ?(ВыборкаДетальныеЗаписи.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест, Истина, Ложь);
		
		СтрокаТКЭ = ТаблицаЭлементовСодержания.Найти(ВыборкаДетальныеЗаписи.ЭлектронныйРесурс, "ЭлектронныйРесурс");
		
		НоваяСтрока.НесколькоЭлементов = ?(
			НЕ НоваяСтрока.ЭтоТест И СтрокаТКЭ <> Неопределено И СтрокаТКЭ.КоличествоЭлементов > 1, Истина, Ложь); 
			
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РазмещениеКнопкиВыхода)
				И НЕ НоваяСтрока.НесколькоЭлементов Тогда
			НоваяСтрока.РазмещениеКнопкиВыхода = ВыборкаДетальныеЗаписи.РазмещениеКнопкиВыхода;
		Иначе
			НоваяСтрока.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ПустаяСсылка();
		КонецЕсли;	
		
	КонецЦикла;
	
	// Устанавливаем видимость элементов
	
	Элементы.ТипПубликации.ТолькоПросмотр = ЗначениеЗаполнено(Параметры.ТипПубликации);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если НЕ ВебКлиент Тогда
		
	Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
		МожноПубликоватьВКаталогНаКлиенте = Истина;
	КонецЕсли;
		
	#КонецЕсли
	
	УстановитьДоступностьЭлементовФормы(); // Необходимо, так как есть сохраняемые реквизиты
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьПроцессПубликации();
	КонецЕсли;
	
	Оповестить("ЭлектронныйРесурсОпубликован");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипПубликацииПриИзменении(Элемент)
	ОтменитьПроцессПубликации();
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьБраузерПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СохранятьАктивностьПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьИнтерфейсПреподавателяПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеРесурсыРазмещениеКнопкиВыходаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьЭкспорт(Команда)	
	
	// Делаем проверки
	//
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПарольПользователя)
		И Объект.ПарольПользователя <> ПодтверждениеПароляПользователя Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Пароль пользователя и его подтверждение не совпадают'"));
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПарольПреподавателя)
		И Объект.ПарольПреподавателя <> ПодтверждениеПароляПреподавателя Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Пароль преподавателя и его подтверждение не совпадают'"));
		
		Возврат;
		
	КонецЕсли;
	
	
	// Выбираем каталог для публикации
	
	Объект.КаталогДляСохранения = "";
	
	Если Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3") Тогда
		МожноПубликоватьВКаталогНаКлиенте = Ложь;
	Иначе
		МожноПубликоватьВКаталогНаКлиенте = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда

	Если МожноПубликоватьВКаталогНаКлиенте
		И Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML") Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
		ДиалогОткрытияФайла.Каталог = Объект.КаталогДляСохранения;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите каталог для копирования публикации'");
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			
			Объект.КаталогДляСохранения = ДиалогОткрытияФайла.Каталог;			
			Объект.КаталогДляСохранения = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.КаталогДляСохранения);
			
		Иначе
			
		    Возврат;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	#КонецЕсли
	
	// Делаем публикацию
	//	
	
	РезультатЭкспорта = ВыполнитьПубликацию();
	
	Если РезультатЭкспорта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчикаОжидания = Новый Структура;
	
	Если РезультатЭкспорта.ЗаданиеВыполнено Тогда		
		ЗагрузитьПодготовленныеДанные();
	Иначе		
		ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,МаксимальныйИнтервал,ТекущийИнтервал,КоэффициентУвеличенияИнтервала", 1, 5, 1, 1.1);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеПубликации", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьПроцессПубликации();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталогПубликации(Команда)
	
	Если ЗначениеЗаполнено(Объект.КаталогДляСохранения) Тогда
		ЗапуститьПриложение(Объект.КаталогДляСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	
	МассивФайлов = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеВыгрузки.Версия) Тогда
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ДанныеВыгрузки.ИмяФайлаПакета + " (" + ДанныеВыгрузки.Версия + ")", АдресХранилищаДополнительный));
	Иначе
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ДанныеВыгрузки.ИмяФайлаПакета, АдресХранилищаДополнительный));
	КонецЕсли;	
	
	ОписаниеОповещенияПолученияФайлов = Новый ОписаниеОповещения("СохранитьПродолжение", ЭтотОбъект);
	
	ДиалогСохранения = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохранения.Заголовок = НСтр("ru = 'Сохранение архива публикации'");
	ДиалогСохранения.МножественныйВыбор = Ложь;
	ДиалогСохранения.ПредварительныйПросмотр = Ложь;
	ДиалогСохранения.Фильтр = "Архив ZIP|*.zip";
	
	НачатьПолучениеФайлов(ОписаниеОповещенияПолученияФайлов, МассивФайлов, ДиалогСохранения, Истина);  
	
	
КонецПроцедуры

// Продолжение процедуры (см. выше).
// 
&НаКлиенте
Процедура СохранитьПродолжение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	// Обработка не требуется.
КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаКлиенте
Процедура УдалитьСтарыеПубликации(Команда)
	УдалитьПубликацииНаСервере(Истина);
	ПоказатьПредупреждение(,НСтр("ru = 'Удаление устаревших публикаций завершено'"));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПубликации(Команда)
	УдалитьПубликацииНаСервере(Ложь);
	ПоказатьПредупреждение(,НСтр("ru = 'Удаление всех публикаций завершено'"));
КонецПроцедуры

//----------------------------------//

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


&НаСервере
Функция ВыполнитьПубликацию()
	
	ОтменитьПроцессПубликации();
	
	Если Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS
		И НЕ ЗначениеЗаполнено(ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу()) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог());
		
		Возврат Неопределено;
		
	КонецЕсли;	

	ТаблицаЭР = Объект.ЭлектронныеРесурсы.Выгрузить();
	
	Если Объект.ТипПубликации <> Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда
		Для каждого СтрокаТЭР Из ТаблицаЭР Цикл
			СтрокаТЭР.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.ПустаяСсылка();
		КонецЦикла;	
	КонецЕсли;
	
	ПараметрыПубликации = Новый Структура("
		|ТипПубликации,
		|Описание,
		|УдалитьСтарыеПубликации,
		|ДляТестирования,
		|СохранятьАктивность,
		|ВключитьБраузер,
		|ПредпочитатьФорматВидеоWEBM,
		|ЭлектронныеРесурсы,
		|РазмещениеКнопкиВыхода,
		|УникальныйИдентификатор,
		|КаталогДляСохранения,
		|ВключитьИнтерфейсПреподавателя,
		|ПарольПользователя,
		|ПарольПреподавателя,
		|ПользовательскиеСтили,
		|ЯзыкИнтерфейса,
		|ПоискРазрешен",
		Объект.ТипПубликации,
		Объект.Описание,
		Объект.УдалитьСтарыеПубликации,
		Объект.ДляТестирования,
		Объект.СохранятьАктивность,
		Объект.ВключитьБраузер,
		Объект.ПредпочитатьФорматВидеоWEBM,
		ТаблицаЭР.ВыгрузитьКолонку("ЭлектронныйРесурс"),
		ТаблицаЭР.ВыгрузитьКолонку("РазмещениеКнопкиВыхода"),
		УникальныйИдентификатор,
		Объект.КаталогДляСохранения,
	    Объект.ВключитьИнтерфейсПреподавателя,
		Объект.ПарольПользователя,
		Объект.ПарольПреподавателя,
		Объект.ПользовательскиеСтили,
		Объект.ЯзыкИнтерфейса,
		Объект.ПоискРазрешен);
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"РазработкаСУЗ.ОпубликоватьПакетДанных", 
		ПараметрыПубликации, 
		НСтр("ru = 'Публикация электронных ресурсов'"),
		Истина);
					
	АдресХранилища               = РезультатВыполнения.АдресХранилища;
	АдресХранилищаДополнительный = РезультатВыполнения.АдресХранилищаДополнительный;
	ИдентификаторЗадания         = РезультатВыполнения.ИдентификаторЗадания;

	УстановитьДоступностьЭлементовФормы();
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеПубликации()  
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЗагрузитьПодготовленныеДанные();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеПубликации", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция УстановитьДоступностьЭлементовФормы()	
	
	Если Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда
						
		Объект.СохранятьАктивность = Ложь;
		Объект.ВключитьБраузер = Ложь;
		
		Элементы.УдалитьСтарыеПубликации.Видимость = Истина;
		Элементы.ЭлектронныеРесурсыРазмещениеКнопкиВыхода.Видимость = Истина;
		Элементы.ЯзыкИнтерфейса.Видимость = Ложь;
		
	Иначе
		
		Элементы.УдалитьСтарыеПубликации.Видимость = Ложь;
		Элементы.ЯзыкИнтерфейса.Видимость = Истина;
		Элементы.ЭлектронныеРесурсыРазмещениеКнопкиВыхода.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.СохранятьАктивность.Видимость = ?(Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML, Истина, Ложь);
	Элементы.ВключитьБраузер.Видимость = ?(Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML И Метаданные.Обработки.ПубликацияЭлектронныхРесурсовСУЗ.Макеты.Найти("БраузерGoogleChrome") <> Неопределено, Истина, Ложь);
	
	Элементы.ГруппаПредупреждение.Видимость = ?(
		Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML
		И Объект.СохранятьАктивность
		И НЕ Объект.ВключитьБраузер, Истина, Ложь);
		

	Элементы.ДекорацияПрогресс.Видимость = ЗначениеЗаполнено(ИдентификаторЗадания);
	Элементы.КомандаОтменить.Видимость = ЗначениеЗаполнено(ИдентификаторЗадания);
	Элементы.КомандаОпубликовать.Доступность = НЕ ЗначениеЗаполнено(ИдентификаторЗадания);
	
	Если Объект.ТипПубликации <> ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS")
		И НЕ ЗначениеЗаполнено(ИдентификаторЗадания)
		И ДанныеВыгрузки <> Неопределено
		И ЗначениеЗаполнено(АдресХранилищаДополнительный) Тогда
		
		Если МожноПубликоватьВКаталогНаКлиенте Тогда
			Элементы.КомандаСохранить.Видимость = Ложь;
			Элементы.КомандаОткрыть.Видимость = Истина;
		Иначе
			Элементы.КомандаСохранить.Видимость = Истина;
			Элементы.КомандаОткрыть.Видимость = Ложь;
		КонецЕсли;		
		
	Иначе
		
		Элементы.КомандаСохранить.Видимость = Ложь;
		Элементы.КомандаОткрыть.Видимость = Ложь;
		
	КонецЕсли;
			
	Элементы.ТипПубликации.ТолькоПросмотр = ЗначениеЗаполнено(ИдентификаторЗадания);
	Элементы.Страницы.ТолькоПросмотр = ЗначениеЗаполнено(ИдентификаторЗадания);
	Элементы.ДекорацияВыполнено.Видимость = ?(НЕ ЗначениеЗаполнено(ИдентификаторЗадания) И ДанныеВыгрузки <> Неопределено, Истина, Ложь);	
	
	Если Объект.СохранятьАктивность
		И Объект.ТипПубликации = перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML Тогда
		
		Элементы.ВключитьИнтерфейсПреподавателя.Видимость = Истина;		
		
	Иначе
		
		Элементы.ВключитьИнтерфейсПреподавателя.Видимость = Ложь;
		
	КонецЕсли;	
	
	Если Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.HTML
		ИЛИ Объект.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.SCORM_1_3 Тогда
		
		Элементы.СтраницаЗащита.Видимость = Истина;
		
		Если Объект.СохранятьАктивность
			И Объект.ВключитьИнтерфейсПреподавателя Тогда
			
			Элементы.ГруппаПарольПреподавателя.Видимость = Истина;
			
		Иначе
			
			Элементы.ГруппаПарольПреподавателя.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаЗащита.Видимость = Ложь;
		
	КонецЕсли;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Элементы.КомандаУдалитьСтарыеПубликации.Видимость = (Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS"));
	Элементы.ФормаУдалитьВсеПубликации.Видимость = (Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS"));
	
	//----------------------------------//

	Элементы.ДекорацияРаботаИсчезающейКнопки.Видимость = Ложь;
	
	Если Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS") Тогда
	
		Для каждого СтрокаТЧ Из Объект.ЭлектронныеРесурсы Цикл
		
			Если СтрокаТЧ.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СлеваИсчезающая
				ИЛИ СтрокаТЧ.РазмещениеКнопкиВыхода = Перечисления.ВариантыРазмещенияКнопкиВыходаСУЗ.СправаИсчезающая Тогда
				
				Элементы.ДекорацияРаботаИсчезающейКнопки.Видимость = Истина;
				Прервать;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ОтменитьПроцессПубликации()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ТекущаяОперация = "";
	ИдентификаторЗадания = Неопределено;
	АдресХранилища = "";
	АдресХранилищаДополнительный = "";
	ДанныеВыгрузки = Неопределено;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
		
		ТекущаяОперация = НСтр("ru = 'Выполнено'");		
		ИдентификаторЗадания = Неопределено;		
		УстановитьДоступностьЭлементовФормы();
		
		Возврат Истина;
		
	Иначе
		
		ДанныеПрогресса = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
		
		Если ДанныеПрогресса = Неопределено Тогда			
			ТекущаяОперация = НСтр("ru = 'Публикация....'");			
		Иначе			
			ТекущаяОперация = ДанныеПрогресса.Текст;			
		КонецЕсли;		
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПодготовленныеДанные()
	
	ТекущаяОперация = "";
	ДанныеВыгрузки = Неопределено;
	
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		ДанныеВыгрузки = ПолучитьИзВременногоХранилища(АдресХранилища);
		Если ДанныеВыгрузки = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'В процессе публикации произошла ошибка'");
		КонецЕсли;
		Если ДанныеВыгрузки <> Неопределено И ЗначениеЗаполнено(ДанныеВыгрузки.Размер) Тогда
			ТекущаяОперация = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Размер: %1 Мб'"), Строка(Окр(ДанныеВыгрузки.Размер / (1024 * 1024), 2)));
		КонецЕсли;
	КонецЕсли;		
	
	ИдентификаторЗадания = Неопределено;
	
	УстановитьДоступностьЭлементовФормы();
	
	Если ДанныеВыгрузки <> неопределено 
		И Объект.ТипПубликации = ПредопределенноеЗначение("Перечисление.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS") Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Публикация завершена'"));
		
	КонецЕсли;	

КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаСервере
Процедура УдалитьПубликацииНаСервере(ПропуститьАктуальную = Истина)
	
	Если НЕ ЗначениеЗаполнено(Константы.ПутьКОбщемуКаталогуСУ.Получить()) Тогда
		Возврат;
	КонецЕсли;
	
	// Выбираем все публикации
	
	МассивЭлектронныхРесурсов = Новый Массив;
	
	Для каждого Строка Из Объект.ЭлектронныеРесурсы Цикл	
		МассивЭлектронныхРесурсов.Добавить(Строка.ЭлектронныйРесурс);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииЭлектронныхРесурсов.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ПубликацииЭлектронныхРесурсов.КонтрольнаяСумма,
		|	ПубликацииЭлектронныхРесурсов.Период КАК ДатаПубликации
		|ИЗ
		|	РегистрСведений.ПубликацииЭлектронныхРесурсовСУЗ КАК ПубликацииЭлектронныхРесурсов
		|ГДЕ
		|	ПубликацииЭлектронныхРесурсов.ЭлектронныйРесурс В(&МассивЭлектронныхРесурсов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭлектронныйРесурс,
		|	ДатаПубликации УБЫВ";
	
	Запрос.УстановитьПараметр("МассивЭлектронныхРесурсов", МассивЭлектронныхРесурсов);
	
	ТаблицаПубликаций = Запрос.Выполнить().Выгрузить();	
	
	ПутьККаталогуВыгрузки = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	
	Для каждого ЭлектронныйРесурс Из МассивЭлектронныхРесурсов Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
			ПубликацииРесурса = ТаблицаПубликаций.НайтиСтроки(Новый Структура("ЭлектронныйРесурс", ЭлектронныйРесурс));
			
			ПервыйПропущен = Ложь;
			Для каждого СвойстваПубликации Из ПубликацииРесурса Цикл
			
				Если ПропуститьАктуальную И НЕ ПервыйПропущен Тогда
					ПервыйПропущен = Истина;
					Продолжить;
				КонецЕсли;
				
				ПутьККаталогуПубликации = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуПубликацииЭлектронногоРесурса(ЭлектронныйРесурс, СвойстваПубликации.КонтрольнаяСумма, ПутьККаталогуВыгрузки);				
				
				УдалитьФайлы(ПутьККаталогуПубликации);
				
				НаборЗаписей = РегистрыСведений.ПубликацииЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();				
				НаборЗаписей.Отбор.ЭлектронныйРесурс.Установить(ЭлектронныйРесурс);
				НаборЗаписей.Отбор.Период.Установить(СвойстваПубликации.ДатаПубликации);
				НаборЗаписей.Записать();				
				
			КонецЦикла;
				
			Если НЕ ПропуститьАктуальную Тогда
				
				// Удаляем каталог хранения всех публикаций
				
				ПутьККаталогуПубликацийЭлектронногоРесурса = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуПубликацийЭлектронногоРесурса(ЭлектронныйРесурс, ПутьККаталогуВыгрузки);				
				ККаталогПубликацийЭлектронногоРесурса = Новый Файл(ПутьККаталогуПубликацийЭлектронногоРесурса);
				Если ККаталогПубликацийЭлектронногоРесурса.Существует() И ККаталогПубликацийЭлектронногоРесурса.ЭтоКаталог() Тогда
					УдалитьФайлы(ККаталогПубликацийЭлектронногоРесурса.ПолноеИмя);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
		
		 	ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;					
		
	КонецЦикла;
	
КонецПроцедуры


//----------------------------------//

#КонецОбласти
